#+TITLE: Mysql 索引
#+AUTHOR: Jinghui Hu
#+EMAIL: hujinghui@buaa.edu.cn
#+DATE: <2022-11-03 Thu 10:06:09>
#+HTML_LINK_UP: ../readme.html
#+HTML_LINK_HOME: ../index.html
#+SETUPFILE: ~/.emacs.d/site-lisp/org-html-themes/setup/theme-readtheorg-local.setup
#+PROPERTY: header-args:sql :database test01 :engine mysql :exports both
#+OPTIONS: ^:nil
#+TAGS: mysql


* 索引

#+BEGIN_SRC sql
show tables;
#+END_SRC

#+RESULTS:
| Tables_in_test01 |
|------------------|
| t                |
| t1               |
| user             |

#+BEGIN_SRC sql
  show create table t\G
#+END_SRC

#+RESULTS:
| *************************** 1. row ***************************     |
|--------------------------------------------------------------------|
| Table: t                                                           |
| Create Table: CREATE TABLE `t` (                                   |
| `id` int NOT NULL,                                                 |
| `k` int NOT NULL DEFAULT '0',                                      |
| `s` varchar(16) NOT NULL DEFAULT '',                               |
| PRIMARY KEY (`id`),                                                |
| KEY `k` (`k`)                                                      |
| ) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci |
